{"data":{"page":{"id":"71047924-6759-59a2-9aea-b0b21c016ca1","title":"6 Tough Lessons From My Pro Bono Project-From-Hell","slug":"tough-lessons-pro-bono-project-from-hell","__typename":"ContentfulJournalEntry","dayNumber":"17","month":"December","year":"2018","fullPublishDate":"December 17, 2018","audience":"Freelancers","category":"Project Management","tags":["project management","pro bono","freelance"],"content":{"childContentfulRichText":{"html":"<h2>Before we begin...</h2><p>I'm not sharing this story to gripe. I'm sharing it because making mistakes (even disastrous one) is the best way to improve as a freelancer—and, if you're lucky, you can learn from <i>other</i> people's mistakes, so you don't have to waste time learning the hard way.</p><p>So, with that said, buckle in. It's going to be a bumpy ride.</p><p><i><b>Disclaimer:</b></i><i> one freelancer was harmed in the writing of this blog post.</i></p><h3>Let me tell you a horror story.</h3><p>No, I'm not talking about Freddy Kruger, Norman Bates, or Michael Myers. It's something eeeeeeven more terrifying...</p><p>A project with no project management. <i>(Cue blood-curdling scream.)</i></p><p>It was the summer of 2017, and two years after starting a freelance business career my portfolio was growing steadily. There had been plenty of rough patches—my process was inconsistent, but I felt like I had the skills to knock my next project out of the park.</p><h3>No money, no problem.</h3><p>That week I got connected with a client who wanted a pro-bono website in exchange for referrals. Her organization was full of potential contacts, and it seemed like a great way to get my name out there, so I agreed to do the job.</p><p>Agreed to what, you say? Good question. If only I had asked it.</p><p>Instead, not knowing exactly how to assign a value to \"referrals,\" I put off discussing the specific terms of the engagement until it fell completely off my radar. I was doing the work for free, and I figured that meant it would be ok to play everything by ear.</p><p><i><b>Lesson #1, Talk Money:</b></i><i> Never assume free work will be valued by a client. In fact, assume the opposite. If you don't talk about money and value from the get-go, it will take all of about five seconds for your role to change from expert to pixel-pusher.</i></p><h3>All sunshine and rainbows. At first.</h3><p>The project started well. Everyone was on the same page, and we were feeling the shared excitement of envisioning all the possibilities for the new website—story submissions, blog posts, video content, custom forms...</p><p>It didn't take long, though, for things to begin falling apart at the seams.</p><p>While we made it through the prototyping phase, the writer who was supposed to deliver the content got tied up with other (read: higher-priority) work and ended up delivering more than a month late, in which time I became the focal point of my client's growing frustration and impatience.</p><p>As we moved into development and watched our original January 1st deadline sail past, the number and specificity of revisions increased exponentially. The relationship had gradually devolved from a place of trust and respect to a near-battle royale, with paranoia and micromanagement in one corner (my client) and exhaustion and resentment (me) in the other.</p><p><i><b>Lesson #2, Get Serious:</b></i><i> Right after the money discussion, you need to have a time discussion. That means clearly mapping out the project scope, assigning roles, and agreeing on important milestones. Better yet, implement a contract with penalties for delays or late deliverables, so everyone knows this is a serious commitment.</i></p><h3>Maintenance: the final straw</h3><p>By that summer, I had finally ironed out 95% percent of my clients' requests, and it was time to decide how the new website was going to be managed.</p><p>While I had started the project feeling like it would be no big deal to host and maintain the site for free (in return for continued referrals) I knew the level of changes my client would inevitably request necessitated a bigger fee. I quoted $75/mo (which, in truth, was still not enough), but my client only became more angry.</p><p>How can I go from $0/year to $900/year???</p><p>That was more than reasonable, I claimed, given the fact that we had developed a custom WordPress theme to support all the custom features we had agreed on—plus regular updates and future customizations.</p><p><i><b>Lesson #3, No Surprises:</b></i><i> Assume your clients know nothing about what you do. When scope creep sets in, you need to identify it and explain what those additions will cost, so your client doesn't get broadsided at the end of the project.</i></p><h3>The sum of all my mistakes</h3><p>If you've read this far, you're probably thinking: \"It can't get any worse!\" Sorry, friend, but the the worst is yet to come.</p><p>Despite all the malcontent, my client did acknowledge (at least in part) how much free work had gone into the project thus far, so she invited me to set up a station at the event to present the website and—hopefully—make some connections. I felt obliged to try and salvage SOMETHING from the project, so I agreed to come.</p><p>But with the maintenance question unresolved and the website not yet finished, I felt like I was walking into a death trap of my own design. That wasn't far from the truth, because amid all the stress, I forgot both my business cards and my iMac's power cord...which, you can imagine, led to a ridiculously awkward and dismal night.</p><p><i><b>Lesson #4, Come prepared (or not at all):</b></i><i> Do not present half-baked work. If you're feeling unconfident, explain to your client that the deliverable isn't quite ready and you would like to reschedule so as not to waste their time.</i></p><p>The days after were even more contentious. Having lost any remaining shred of trust in me, my client set up a conference call with her previous developer—who proceeded to tear down my pricing and process.</p><p>To be fair, he was brought in with zero understanding of what had been built (though, he did make plenty of valid critiques, which I've captured here). But the humiliation of being lectured to by someone who had done the previous website for free and hadn't even bothered to maintain it stung more than anything I can remember.</p><p><i><b>Lesson #5, Trust Matters:</b></i><i> You cannot work without trust. If you come to feel that you have completely lost a client's trust, you need to end the project and issue a refund (as necessary), because it's simply not something you can rebuild.</i></p><h3>Making things right</h3><p>By this point, I was willing to do anything to make a clean break—I didn't even care about the hundreds of hours I had wasted on the project.</p><p>I suggested to my client that we take the existing content and move it to Squarespace, where she could easily manage the site herself (minus the higher-quality design and custom features). I vividly remember my client agreeing, while simultaneously remarking, \"I just needed something simple!\"</p><p>I silently shook my head in disbelief, thinking how ironic that sounded considering everything we had been through. In retrospect, though, I realized she was right. Everyone <i>wants</i> a Ferrari—they may even talk as if the <i>need</i> one, but few people really do.</p><p>Similarly, clients often hire you because they <i>want</i> something. <b>But it's your job to figure out what they really </b><b><i>need</i></b>. And if you can't tell the difference between the two, you have to keep asking questions until you can.</p><p><i><b>Lesson #6, Ask Lots of Good Questions:</b></i><i> Not knowing what you or your client doesn't know is a dangerous state to be in. If you feel uncertain (or if you feel TOO certain), stay in the diagnostic phase as long as you can. You'll thank yourself later.</i></p><h2>Wrapping Up</h2><p>So there it is. My pro bono project-from hell. To date, it's been my worst experience as a freelancer, but also the experience that taught me the most.</p><p>Have a nightmare project of your own? Drop it in the comments below, or tweet it to me <a href=\"https://www.twitter.com/aofolts\">@aofolts</a>. I'd love to hear what other people learned from their biggest mistakes.</p>"}},"featuredImage":{"title":"Firemen putting out car fire","alt":"","fluid":{"base64":null,"aspectRatio":1.5058823529411764,"src":"//images.ctfassets.net/rupfy7kogibm/4mzIcTJ6EUg6OC4QIWO6i2/dcd60853c8a556ebb4c45e18ee006b02/firefighter-extinguish-fire-extinction-47863.jpeg?w=1920&q=50","srcSet":"//images.ctfassets.net/rupfy7kogibm/4mzIcTJ6EUg6OC4QIWO6i2/dcd60853c8a556ebb4c45e18ee006b02/firefighter-extinguish-fire-extinction-47863.jpeg?w=480&h=319&q=50 480w,\n//images.ctfassets.net/rupfy7kogibm/4mzIcTJ6EUg6OC4QIWO6i2/dcd60853c8a556ebb4c45e18ee006b02/firefighter-extinguish-fire-extinction-47863.jpeg?w=960&h=638&q=50 960w,\n//images.ctfassets.net/rupfy7kogibm/4mzIcTJ6EUg6OC4QIWO6i2/dcd60853c8a556ebb4c45e18ee006b02/firefighter-extinguish-fire-extinction-47863.jpeg?w=1920&h=1275&q=50 1920w","sizes":"(max-width: 1920px) 100vw, 1920px"}}}},"pageContext":{"slug":"tough-lessons-pro-bono-project-from-hell"}}