{"data":{"page":{"id":"d63fc376-5beb-50b5-a638-7be9de3badac","title":"The Best Web Developers Are Lazy (That’s a Good Thing)","slug":"best-web-developers-lazy-good-thing","__typename":"ContentfulJournalEntry","dayNumber":"6","month":"July","year":"2018","fullPublishDate":"July 6, 2018","tags":["web developer","lazy","DRY","coding"],"content":{"childContentfulRichText":{"html":"<h2>The Origins of My Laziness</h2><p>I finished my first major website back in 2014. It took three months of nonstop work. These days I build higher-quality, more complex sites in around 40 hours.</p><p>My secret? I learned to be lazy.</p><p>Now, don’t take that the wrong way. I’m working harder than I ever have, but my productivity as a developer has increased exponentially over time because I implemented a zero-tolerance policy for wastefulness.</p><p>In code speak, everything I do now is as “DRY” as possible.</p><h2>What’s DRY?</h2><p>I built many of my early sites using pre-made WordPress themes — and although they looked great initially, I quickly discovered how much redundant work was required to “hack” them into a format that fit my clients’ specific needs.</p><p>It’s not so bad adding a hundred food menu items until you realize that the layout of these menu items needs to change — and you have to go back and manually edit every… single… one.</p><p>This is both financially and mentally untenable for clients and developers, which is why I follow the DRY mantra…</p><p>aka: “Don’t Repeat Yourself.”</p><h2>A Very DRY Example</h2><p>Custom-coded websites provide excellent opportunities for implementing DRY processes. For example, instead of trying to update 100 menu items, I can create one template that accepts the minimal amount of information from each item (title, price, description).</p><p>In the backend of the website, my clients can simply fill out this info and it gets rendered by the template in a consistent, visually appealing format.</p><p>If my client asks me to alter the appearance of these menu items, I can make the change once in the template — and voila — it will take effect throughout the entire site, everywhere they display.</p><h2>Where DRY and Lazy Meet</h2><p>I think “laziness” gets a bad rap because it’s associated with present-tense laxness — i.e. “I don’t want to do the dishes right now.”</p><p>But to keep moving forward as a developer (or as any professional, really) it’s essential to have a lazy attitude toward the future.</p><p>Take Molly, for example, a fictional kid in <a href=\"https://www.youtube.com/watch?v=sygqZWBcuKk\">GE’s Inventing commercial</a> who really doesn’t want to take out the trash.</p><p>Once is enough, it turns out. She decides her brainpower can be put to better use and creates a pulley line to handle the job for her… which leads to more inventions and eventually a job at GE.</p><h2>Wrapping Up</h2><p>It’s weird to say, but I think laziness is probably one of the most important drivers of innovation in the world.</p><p>Like Molly, most web developers (and people, in general) don’t want to get stuck doing menial, repetitive tasks.</p><p>We’re all lazy—in the best way possible—and that aversion toward monotony is what motivates us to keep creating brilliant, creative solutions to challenges. Because even the smallest amount of extra effort <i>now</i> can pay off a hundred fold down the road.</p>"}},"featuredImage":{"title":"Lazy dog on carpet","alt":"","fluid":{"base64":null,"aspectRatio":1.5009380863039399,"src":"//images.ctfassets.net/rupfy7kogibm/4CcjbfwwuQkMO8YgIokyKc/842f8ae885c28fe9089900796eb26b77/lazy-dog-carpet.jpg?w=1920&q=50","srcSet":"//images.ctfassets.net/rupfy7kogibm/4CcjbfwwuQkMO8YgIokyKc/842f8ae885c28fe9089900796eb26b77/lazy-dog-carpet.jpg?w=480&h=320&q=50 480w,\n//images.ctfassets.net/rupfy7kogibm/4CcjbfwwuQkMO8YgIokyKc/842f8ae885c28fe9089900796eb26b77/lazy-dog-carpet.jpg?w=960&h=640&q=50 960w,\n//images.ctfassets.net/rupfy7kogibm/4CcjbfwwuQkMO8YgIokyKc/842f8ae885c28fe9089900796eb26b77/lazy-dog-carpet.jpg?w=1600&h=1066&q=50 1600w","sizes":"(max-width: 1920px) 100vw, 1920px"}}}},"pageContext":{"slug":"best-web-developers-lazy-good-thing"}}